//----------------------------------------------------------------------------

//Модуль реализации протокола Wake: header file

//----------------------------------------------------------------------------

#ifndef _WAKE_EXCHANGE_
#define _WAKE_EXCHANGE_

//----------------------------------------------------------------------------

#include <wake.h>

#define FRAME 	 34      //максимальная длина поля данных в пакете  16 reg by 2 bytes + 1 byte index + 1 byte count
//----------------------------------------------------------------------------

extern uint8_t Rx_Ma_Cmd,          //принятая команда
							 Rx_Ma_Nbt,          //принятое количество байт в пакете
							 Rx_Ma_Dat[FRAME];   //массив принятых данных

extern uint8_t Master_Command;         //код принятой команды на выполнение

extern uint8_t Tx_Ma_Cmd,          //команда, передаваемая в пакете
               Tx_Ma_Nbt,          //количество байт данных в пакете
							 Tx_Ma_Sta,					 //состояние передачи
               Tx_Ma_Dat[FRAME];   //массив данных для передачи

//----------------------------------------------------------------------------

void WakeMaster_Init(UART_HandleTypeDef *huart);        //инициализация порта
void WakeMaster_Tx(void);          											//передача пакета
uint8_t WakeMaster_TxDone(void);      									//проверка окончания передачи

void WakeMaster_UART_Tx(void);													// Обработчик отправленного байта
void WakeMaster_UART_Rx(void);													// Обработчик принятого байта

//----------------------------------------------------------------------------

#endif
