//----------------------------------------------------------------------------

//Модуль реализации протокола Wake: header file

//----------------------------------------------------------------------------

#ifndef _WAKE_EXCHANGE_
#define _WAKE_EXCHANGE_

//----------------------------------------------------------------------------

#include <wake.h>

#define FRAME 	 34      //максимальная длина пакета   16 reg by 2 bytes + 1 byte index + 1 byte count
//----------------------------------------------------------------------------

extern uint8_t Rx_Cmd,          //принятая команда
							 Rx_Nbt,          //принятое количество байт в пакете
							 Rx_Dat[FRAME];   //массив принятых данных

extern uint8_t Command;         //код принятой команды на выполнение

extern uint8_t Tx_Cmd,          //команда, передаваемая в пакете
               Tx_Nbt,          //количество байт данных в пакете
               Tx_Dat[FRAME];   //массив данных для передачи

//----------------------------------------------------------------------------

void Wake_Init(UART_HandleTypeDef *huart);        //инициализация порта
void Wake_Tx(void);          											//передача пакета
uint8_t Wake_TxDone(void);      									//проверка окончания передачи

void Wake_UART_Tx(void);													// Обработчик отправленного байта
void Wake_UART_Rx(void);													// Обработчик принятого байта

//----------------------------------------------------------------------------

#endif
