//----------------------------------------------------------------------------

//Модуль реализации выполнения команд: header file

//----------------------------------------------------------------------------

#ifndef _WAKE_CMD_H_
#define _WAKE_CMD_H_

//-------------------------------- Константы: --------------------------------

//Коды специальных команд:

#define CMD_SETPAR     6 //установка 1-го параметра
#define CMD_GETPAR     7 //чтение 1-го параметра
#define CMD_SETPARS    8 //запись N параметров
#define CMD_GETPARS    9 //чтение N параметров

//---------------------------- Прототипы функций: ----------------------------

void Wake_Commands_Exe(void); //выполнение команд

//----------------------------------------------------------------------------

#endif
